In [1]:
print("inteligencia artificial")

inteligencia artificial

In [ ]:
pip install pandas

In [3]:
import pandas as pd

In [8]:
Dicionario = {"A":[1,2,3,4],
              "B":[5,6,7,8],
              "C":[9,10,11,12]}
Labels = ["1ª linha","2ª linha","3ª linha","4ª linha"]

In [9]:
dados = pd.DataFrame(Dicionario,index = Labels) #cria o dataframe

In [10]:
dados.head() #exibe as 4 primeiras linhas da base de dados

          A  B   C
1ª linha  1  5   9
2ª linha  2  6  10
3ª linha  3  7  11
4ª linha  4  8  12

In [11]:
dados.head(2)

          A  B   C
1ª linha  1  5   9
2ª linha  2  6  10

In [12]:
dados.describe()

              A         B          C
count  4.000000  4.000000   4.000000
mean   2.500000  6.500000  10.500000
std    1.290994  1.290994   1.290994
min    1.000000  5.000000   9.000000
25%    1.750000  5.750000   9.750000
50%    2.500000  6.500000  10.500000
75%    3.250000  7.250000  11.250000
max    4.000000  8.000000  12.000000

In [13]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1ª linha to 4ª linha
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [14]:
dados['D']= dados['B']= dados['C'] #multiplicação de colunas do DF

In [15]:
dados.head()

          A   B   C   D
1ª linha  1   9   9   9
2ª linha  2  10  10  10
3ª linha  3  11  11  11
4ª linha  4  12  12  12

In [16]:
dados.drop('B', axis=1,inplace=True) #exclui a coluna b, o inplace parmite a exclusão de uma coluna na base de dados original

In [21]:
dados.loc["3ª linha"] #busca uma linha

A     3
C    11
D    11
Name: 3ª linha, dtype: int64

In [23]:
dados.loc[["3ª linha","2ª linha"],["A","C"]] #busca mais de uma linha e coluna no dataframe

          A   C
3ª linha  3  11
2ª linha  2  10

In [24]:
dados.iloc[0:2,0:2] #localiza

          A   C
1ª linha  1   9
2ª linha  2  10

In [25]:
dados['A']>0 #filtro

1ª linha    True
2ª linha    True
3ª linha    True
4ª linha    True
Name: A, dtype: bool

In [26]:
Filtro = dados['A']>0 #armazena o resultado na variàvel filtro

In [27]:
Filtro

1ª linha    True
2ª linha    True
3ª linha    True
4ª linha    True
Name: A, dtype: bool

In [28]:
dados['Filtro']= Filtro # armazena o filtro nessa base de dados

In [31]:
dados[(dados['A']>=2)& (dados['C']>=2)] #filtro na coluna

          A   C   D  Filtro
2ª linha  2  10  10    True
3ª linha  3  11  11    True
4ª linha  4  12  12    True

In [30]:
dados.reset_index()

      index  A   C   D  Filtro
0  1ª linha  1   9   9    True
1  2ª linha  2  10  10    True
2  3ª linha  3  11  11    True
3  4ª linha  4  12  12    True

In [32]:
dados.set_index('C') #altera o index do dataframe

    A   D  Filtro
C
9   1   9    True
10  2  10    True
11  3  11    True
12  4  12    True

In [34]:
Dicionario_1 = {"A":[10,20,30,40],
              "B":[50,60,70,80],
              "C":[90,100,110,120],
              "Chaves":['AA','BB','CC','DD'],}

Dicionario_2 = {"A":[5,10,15,20],
              "B":[35,70,105,140],
              "C":[100,200,300,400],
              "Chaves":['AA','BB','CC','DD'],}

Dicionario_3 = {"A":[-10,-20,-30,-40],
              "B":[25,50,75,100],
              "C":[90,100,110,120],
              "Chaves":['AA','BB','CC','DD'],}

Labels_1 = ["1ª linha","2ª linha","3ª linha","4ª linha"]
Labels_2 = ["5ª linha","6ª linha","7ª linha","8ª linha"]
Labels_3 = ["9ª linha","10ª linha","11ª linha","12ª linha"]

In [35]:
df1 = pd.DataFrame(Dicionario_1, index=Labels_1)
df2 = pd.DataFrame(Dicionario_2, index=Labels_2)
df3 = pd.DataFrame(Dicionario_3, index=Labels_3)

In [36]:
dados_df = pd.concat([df1,df2,df3]) #junta os dataframes desde que todos tenham a mesma estrutura

In [37]:
dados_df.head(10)

            A    B    C Chaves
1ª linha   10   50   90     AA
2ª linha   20   60  100     BB
3ª linha   30   70  110     CC
4ª linha   40   80  120     DD
5ª linha    5   35  100     AA
6ª linha   10   70  200     BB
7ª linha   15  105  300     CC
8ª linha   20  140  400     DD
9ª linha  -10   25   90     AA
10ª linha -20   50  100     BB

In [40]:
df_1 = pd.merge(df1,df2,how='inner', on='Chaves') #une o dataframe a partir da semelhança das chaves nas colunas

In [41]:
df_1.head()

   A_x  B_x  C_x Chaves  A_y  B_y  C_y
0   10   50   90     AA    5   35  100
1   20   60  100     BB   10   70  200
2   30   70  110     CC   15  105  300
3   40   80  120     DD   20  140  400

In [46]:
Dicionario_1 = {"A":[10,20,30,40],
              "B":[50,60,70,80],
              "C":[90,100,110,120]}

Dicionario_3 = {"D":[30,20,50,40],
              "E":[1,2,3,4],
              "F":[7,8,9,10]}

Labels_n = ["1ª linha","2ª linha","3ª linha","4ª linha"]

In [47]:
Dataframe1 = pd.DataFrame(Dicionario_1,index=Labels_1)
Dataframe3 = pd.DataFrame(Dicionario_3,index=Labels_1)

In [48]:
Dataframe1.join(Dataframe3) #unifica os dataframes com base no label

           A   B    C   D  E   F
1ª linha  10  50   90  30  1   7
2ª linha  20  60  100  20  2   8
3ª linha  30  70  110  50  3   9
4ª linha  40  80  120  40  4  10

In [51]:
#EXERCÍCIO 1
Dicionario_ex1 = {
    'Nome':['Alice','Julia','Bruna','Daniel','Felipe','Silvio'],
    'Idade':[19,22,28,34,28,48],
    'Profissao':['Direito','Engenharia','Enfermagem','Engenharia Civil','Cientista','Eletrônico'],
    'ID':[1,2,3,4,5,6]
    }

Labels_ex1 = ["1ª linha","2ª linha","3ª linha","4ª linha","5ª linha","6ª linha"]

In [52]:
Dataframe_ex1 = pd.DataFrame(Dicionario_ex1,index = Labels_ex1) #cria o dataframe

In [54]:
Dataframe_ex1.head(6)

            Nome  Idade         Profissao  ID
1ª linha   Alice     19           Direito   1
2ª linha   Julia     22        Engenharia   2
3ª linha   Bruna     28        Enfermagem   3
4ª linha  Daniel     34  Engenharia Civil   4
5ª linha  Felipe     28         Cientista   5
6ª linha  Silvio     48        Eletrônico   6